package Lesson1.Task;

import java.time.LocalDateTime;

// Настроить проект, вывести в консоль “Hello world!”.
// Вывести в консоль системные дату и время.

public class Task1 {
    public static void run() {
        System.out.println("Hello world");
        System.out.println(LocalDateTime.now());
    }
}
